[
  {
    "scene" : 0,
    "COMMENTS" : "The JSON holds an arrray of scene objects.
                  Each scene object has an array of infopoint objects
                  stating where they are in the scene, the title for their info
                  pop-up, the text for their info pop-up, background image ref
                  and an array of titles and text for 'learn more' buttons."
  }

  {
    "scene" : 1,
    "infopoints" : [
      {
        "location" : "Introduction",
        "title" : "The Stone Age",
        "description" : "The Stone Age was a broad prehistoric period during which stone was widely used to make implements with a sharp edge, a point, or a percussion surface. The period lasted roughly 3.4 million years, and ended between 6000 BCE and 2000 BCE with the advent of metalworking",
        "learn_more" : [
          {
          "topic" : "Tools",
          "detail" : "Stone tools were made from a variety of stones. For example, flint and chert were shaped (or chipped) for use as cutting tools and weapons, while basalt and sandstone were used for ground stone tools, such as quern-stones. Wood, bone, shell, antler (deer) and other materials were widely used, as well. During the most recent part of the period, sediments (such as clay) were used to make pottery. Agriculture was developed and certain animals were domesticated as well."
          }
          {
          "topic" : "Food",
          "detail" : "Food sources of the Palaeolithic hunter-gatherers were wild plants and animals harvested from the environment. They liked animal organ meats, including the livers, kidneys and brains. Large seeded legumes were part of the human diet long before the agricultural revolution, as is evident from archaeobotanical finds from the Mousterian layers of Kebara Cave, in Israel. Moreover, recent evidence indicates that humans processed and consumed wild cereal grains as far back as 23,000 years ago in the Upper Paleolithic."
          }
          {
          "topic" : "Shelter",
          "detail" : "Around 2 million years ago, Homo habilis is believed to have constructed the first man-made structure in East Africa, consisting of simple arrangements of stones to hold branches of trees in position. A similar stone circular arrangement believed to be around 380,000 years old was discovered at Terra Amata, near Nice, France. (Concerns about the dating have been raised, see Terra Amata)."
          }
        ]
      }
    ]
  }

  {
    "scene" : 2,
    "infopoints" : [
      {
        "location" : "Introduction",
        "title" : "The Renaissance",
        "description" : "The Renaissance was a period in Europe, from the 14th to the 17th century, considered the bridge between the Middle Ages and modern history. It started as a cultural movement in Italy in the Late Medieval period and later spread to the rest of Europe, marking the beginning of the Early Modern Age.",
        "learn_more" : [
          {
          "topic" : "Leonardo daVinci",
          "detail" : "Leonardo di ser Piero da Vinci, more commonly Leonardo da Vinci, (15 April 1452 – 2 May 1519) was an Italian polymath whose areas of interest included invention, painting, sculpting, architecture, science, music, mathematics, engineering, literature, anatomy, geology, astronomy, botany, writing, history, and cartography. He has been variously called the father of paleontology, ichnology, and architecture, and is widely considered one of the greatest painters of all time. Sometimes credited with the inventions of the parachute, helicopter and tank, his genius epitomized the Renaissance humanist ideal."
          }
          {
          "topic" : "Francis Bacon",
          "detail" : "Sir Francis Bacon, 1st Viscount St Alban (22 January 1561 – 9 April 1626) was an English philosopher, statesman, scientist, jurist, orator, essayist and author. He served both as Attorney General and Lord Chancellor of England. After his death, he remained extremely influential through his works, especially as philosophical advocate and practitioner of the scientific method during the scientific revolution."
          }
          {
          "topic" : "Galileo Galilei",
          "detail" : "Galileo Galilei (15 February 1564 – 8 January 1642), was an Italian astronomer, physicist, engineer, philosopher, and mathematician who played a major role in the scientific revolution during the Renaissance. Galileo has been called the 'father of observational astronomy', the 'father of modern physics', and the 'father of science'. His contributions to observational astronomy include the telescopic confirmation of the phases of Venus, the discovery of the four largest satellites of Jupiter (named the Galilean moons in his honour), and the observation and analysis of sunspots. Galileo also worked in applied science and technology, inventing an improved military compass and other instruments."
          }
        ]
      }
      {
        "location" : "Leonardo_House",
        "title" : "Leonardo DaVinci",
        "description" : "Welcome to Leonardo's workshop, home to one of the period's most renowned and prodigious characters",
        "learn_more" : [
          {
          "topic" : "Leonardo Da Vinci's Life",
          "detail" : "Leonardo had many friends who are now renowned either in their fields or for their historical significance. They included the mathematician Luca Pacioli, with whom he collaborated on the book De divina proportione in the 1490s. Leonardo appears to have had no close relationships with women except for his friendship with Cecilia Gallerani and the two Este sisters, Beatrice and Isabella. He drew a portrait of Isabella while on a journey which took him through Mantua, and which appears to have been used to create a painted portrait, now lost."
          }
          {
          "topic" : "Leonardo Da Vinci's Works",
          "detail" : "Leonardo's early works begin with the Baptism of Christ painted in conjunction with Verrocchio. Two other paintings appear to date from his time at the workshop, both of which are Annunciations. One is small, 59 centimetres (23 in) long and 14 centimetres (5.5 in) high. It is a 'predella' to go at the base of a larger composition, in this case a painting by Lorenzo di Credi from which it has become separated. The other is a much larger work, 217 centimetres (85 in) long. In both these Annunciations, Leonardo used a formal arrangement, such as in Fra Angelico's two well-known pictures of the same subject, of the Virgin Mary sitting or kneeling to the right of the picture, approached from the left by an angel in profile, with a rich flowing garment, raised wings and bearing a lily. Although previously attributed to Ghirlandaio, the larger work is now generally attributed to Leonardo."
          }
          {
          "topic" : "Leonardo Da Vinci's Influences",
          "detail" : "Florence, at the time of Leonardo's youth, was the centre of Christian Humanist thought and culture. Leonardo commenced his apprenticeship with Verrocchio in 1466, the year that Verrocchio's master, the great sculptor Donatello, died. The painter Uccello, whose early experiments with perspective were to influence the development of landscape painting, was a very old man. The painters Piero della Francesca and Filippo Lippi, sculptor Luca della Robbia, and architect and writer Leon Battista Alberti were in their sixties. The successful artists of the next generation were Leonardo's teacher Verrocchio, Antonio del Pollaiuolo and the portrait sculptor, Mino da Fiesole whose lifelike busts give the most reliable likenesses of Lorenzo Medici's father Piero and uncle Giovanni.",
          "player_learning": "davinci_influence"
          }
        ]
      }      
      {
        "location" : "Harbour",
        "title" : "Francis Bacon's Ship",
        "description" : "About to set sail...",
        "learn_more" : [
          {
          "topic" : "Topic 1",
          "detail" : "more info on topic 1"
          }
          {
          "topic" : "Topic 2",
          "detail" : "more info on topic 2"
          }
          {
          "topic" : "Topic 3",
          "detail" : "more info on topic 3"
          }
          {
          "topic" : "Topic 4",
          "detail" : "more info on topic 4"
          }
        ]
      }
      {
        "location" : "Galileo",
        "title" : "Galileo Galilei's Workshop",
        "description" : "What, no parachute?",
        "learn_more" : [
          {
          "topic" : "Topic 1",
          "detail" : "more info on topic 1"
          }
          {
          "topic" : "Topic 2",
          "detail" : "more info on topic 2"
          }
          {
          "topic" : "Topic 3",
          "detail" : "more info on topic 3"
          }
          {
          "topic" : "Topic 4",
          "detail" : "more info on topic 4"
          }
        ]
      }
    ],
    "characters" : [
      {
        "tag" : "leonardo",
        "name" : "Leonardo da Vinci",
        "welcome" : "Buongiorno, what brings you to my workshop? I am quite busy right now...",
        "dialogues" : [
          {
            "question_1" : "Tell me about your life ...",
            "response_1" : "I was born here in Vinci ..."
          }
          {
            "question_2" : "Who were your influences ...",
            "response_2" : "Archimedes of Syracuse ..."
          }
      	  {
      	    "question_3" : "What are you working on now ...",
            "response_3" : "I'm trying to visualise ..."
          }
          {
            "question_4" : "How can I help you ...",
            "response_4" : "I need some charcoal ..."
          }
        ]
      }
      {
        "tag" : "francis",
        "name" : "Francis Bacon",
        "welcome" : "Ahoy shipmate...",
        "dialogues" : [
          {
            "question_1" : "Tell me about your life ...",
            "response_1" : "I was born here in Vinci ..."
          }
          {
            "question_2" : "Who were your influences ...",
            "response_2" : "Archimedes of Syracuse ..."
          }
      	  {
      	    "question_3" : "What are you working on now ...",
            "response_3" : "I'm trying to visualise ..."
          }
          {
            "question_4" : "How can I help you ...",
            "response_4" : "I need some charcoal ..."
          }
        ]
      }
      {
        "tag" : "galileo",
        "name" : "Galileo Galilei",
        "welcome" : "Hello ...",
        "dialogues" : [
          {
            "question_1" : "Tell me about your life ...",
            "response_1" : "I was born here in Vinci ..."
          }
          {
            "question_2" : "Who were your influences ...",
            "response_2" : "Archimedes of Syracuse ..."
          }
      	  {
      	    "question_3" : "What are you working on now ...",
            "response_3" : "I'm trying to visualise ..."
          }
          {
            "question_4" : "How can I help you ...",
            "response_4" : "I need some charcoal ..."
          }
        ]
      }
    ]
  }

  {
    "scene" : 3,
    "infopoints" : [
      {
        "location" : "Infopoint_Scene_3",
        "title" : "Ancient Egypt",
        "description" : "Explore the Pyramids and the wonders of ancient egypt",
        "learn_more" : [
          {
          "topic" : "Egyptian Topic 1",
          "detail" : "more info on topic 1"
          }
          {
          "topic" : "Egyptian Topic 2",
          "detail" : "more info on topic 2"
          }
          {
          "topic" : "Egyptian Topic 3",
          "detail" : "more info on topic 3"
          }
        ]
      }
    ]
  }

  {
    "scene" : 4,
    "infopoints" : [
      {
        "location" : "Infopoint_Scene_4",
        "title" : "The Modern Age",
        "description" : "Bright lights, big city",
        "learn_more" : [
          {
          "topic" : "Modern Topic 1",
          "detail" : "more info on topic 1"
          }
          {
          "topic" : "Modern Topic 2",
          "detail" : "more info on topic 2"
          }
          {
          "topic" : "Modern Topic 3",
          "detail" : "more info on topic 3"
          }
          {
          "topic" : "Modern Topic 4",
          "detail" : "more info on topic 4"
          }
        ]
      }
    ]
  }
]
